---
kind: type
id: T:Autodesk.Revit.DB.Fabrication.FabricationPartRouteEnd
source: html/58bd199f-5114-67de-011b-d054a1a4c4d9.htm
---
# Autodesk.Revit.DB.Fabrication.FabricationPartRouteEnd

Class to hold fabrication part routing start or end information.

## Syntax (C#)
```csharp
public class FabricationPartRouteEnd : IDisposable
```

## Remarks
To create a new instance, use CreateFromConnector(Connector) to specify a connector,
 or CreateFromCenterline(Element, XYZ) to specify the centerline of a straight element,
 for the fabrication routing end point.